package Bones.Cranium;

import Bones.Bones;

public class Cranium extends Bones {

/**
1) краниометрические точки:
*alveolare (al)  альвеоляре - точка, лежащая на нижнем крае верней
     челюсти между передними резцами, обычно располагается на 2-3 мм.
     ниже точки простион.

*asterion (ast) Астерион - точка соединения теменной, височной и
    затылочной костей; располагается в месте схождения ламбдавидного,
    затылочно-сосцевидного и теменно-сосцевидного швов.

*auriculare (au)  Аурикуляре  - точна на корне скулового отростка
    височной кости, лежащая над серединой наружного слухового отверстия.

* basion (ba) Базион - самая нижняя точка, расположенная на переднем
    крае большого затылочного отверстия в медианной плоскости.

* bregma (b) Брегма - точка в месте схождения стреловидного и венечного
    швов.

* vertex (v) Вертекс - наивысшая точка темени, определяемая  при
    положении черепа в ушно-гразничной (франкфуртской) горизонтальной
    плоскости, проходящей через верхние края ушных отверстий (точки porion (po))
    и нижний край левой орбиты.

* glabella (g) Глабелла - наиболее выступающая вред точка между
    надбровными дугами, при положении черепа во франкфуртской
    горизонтальной плоскости.

* gnation (gn) Гнатион - точка на нижнем крае нижней челюсти в месте
    пересечения его медиально-сагиттальной плоскостью.

* gonion (go) Гонион - точка на наружной поверхности края нижней
    челюсти, лежащая на вершине угла, образованного нижним краем
    тела челюсти и задним краем её ветви.

* dakryon (d) Дакрион - точка соединения лобной, верхне-челюстной и
    слезной костей; лежит несколько глубже точки maxillofrantale (mf).

* zygion (zg) Зигион - наиболее выступающая кнаружи точка на скуловой
    дуге;почти всегда располагается на скуловом отростке височной кости.

* zygomaxillare (zm) Зигомксилляре - самая нижняя точка на
    скуло-челюстном шве.

* infradentale (id) Инфрадентале - точка на верхнем крае альвеолярного
    отростка нижней челюсти между двумя внутренними резцами.

* lambda (l) Лямбда - точка соединения затылочной и обеих теменных
    костей; лежит на пересечении затылочного шва со стреловидным
    швом.

* mastoidale (ms)  Мастоидале - точка, лежащая на вершине
    сосцевидного отростка.

* maxillofrantale (mf) Максилло-фронтале - точка пересечения внутреннего
    края орбиты с лобно-челюстным швом; линию намечают карандашом
    снизу вверх.

* metopion (m) Метопион - лежит на пересечении медиальной плоскости
    с линией, соединяющей наиболее выступающие точки лобных бугров.

* nasion (n) Назион - точка, лежащая в области носо-лобного шва
    медианной плоскости.

* nasospinale (ns) Назоспинале - точка пересечения медиальной плоскости
    с линией, соединяющей нижние края левой и правой половины грушевидного
    отверстия.

* obelion (ob) Обелион - точка, расположенная в месте пересечения
    стреловидного шва с линией, соединяющей центры теменных (сосудистых)
    отверстий.

* opistion (o) Опистион - точка, расположенная на середине заднего
    края большого затылочного отверстия.

* opistokranion (op) Опистокранион - наиболее выступающая кзади и
    наиболее отстоящая от глабеллы точка на затылочной кости в
    медиальной плоскости; её находят эмпирически с помощью толстотного
    циркуля.

* porion (po) Порион - точка, расположенная на верхнем крае наружного
    слухововго прохода глубже точки auriculare (au) .

* prostion (pr) Простион - наиболее выступающая вперед точка на передней
    поверхности верхенечелюстной кости между двумя внутренними
    резцами. От этой точки следует отличать альвеолярную точку,
    лежащую на нижнем крае альвеолярного отростка верхней челюсти
    между теми же резцами.

* frontomalare-orbitale (fmo) Фронто-маляре-орбитале - точка, лежащая
    на месте пересечения наружного края орбиты с лобно-скуловым швом;
    располагается ниже точки  ektokonchion (ek.).

* fronto-malare-temporale (fmt)  Фронто-маляре-темпорале - наиболее
    наружная точка на скуло-лобном шве.

* fronto-temporale (ft.) Фронто-темпорале - точка на височном
    гребне лобной кости, лежащая в месте её наибольшего сужения.

* ektokonchion (ek.) Эктоконхион - точка на наружном крае орбиты,
    где он пересекается линией, проведенной из максилло-фронтальной
     точки (maxillofrantale (mf)) параллельно верхнему краю орбиты, и
    делящей орбиту пополам.

* eurion (eu) Эурион - наиболее выступающая кнаружи (наиболее удаленная
    от медиальной плоскости) точка боковой стенки черепа, лежащая
    чаще всего на теменной кости, реже в верхней части чешуи височной
    кости. Находится эмпирически с помощью толстотного циркуля.

2) размеры (действительны в том случае, если размер установлен
между двумя точками,  (см. выше), предназначенными для его определения !)

* Продольный диаметр - расстояние между точками glabella (g) -
    opistokranion (op).  Измеряется толстотным циркулем.

* Поперечный диаметр - расстояние между точками  eurion (eu) - eurion (eu);
    измеряется толстотным циркулем.
    NB!!!  при измерении нельзя выностить циркуль из горизонтального
    положения!

* Высотный диаметр -  расстояние между точками basion (ba) - bregma (b);
    измеряется толстотным циркулем.

* Длина основания черепа -  расстояние между точками  basion (ba) -  nasion (n);
    измеряется толстотным циркулем.

* Наименьшая ширина лба - расстояние между точками   fronto-temporale (ft.) -  fronto-temporale (ft.);
    измеряется скользящим циркулем.

* Ширина основания черепа - расстояние между точками auriculare (au) - auriculare (au);
    измеряется скользящим циркулем.

* Ширина затылка - расстояние между точками asterion (ast) - asterion (ast);
    измеряется скользящим циркулем.

* Сосцевидная ширина - расстояние между точками  mastoidale (ms)  - mastoidale (ms) ;
    измеряется скользящим циркулем.

* Окружность черепа - измеряется по линии, проходящей спереди через надпереносье,
    сзади через наиболее выступающие части затылочной кости. Измеряется лентой.

* Сагиттальная хорда - расстояние между точками  nasion (n) -  opistion (o);
    измеряется толстотным циркулем.

* Лобная хорда - расстояние между точками  nasion (n) - bregma (b);
    измеряется скользящим циркулем.

* Теменная часть сагиттальной хорды - расстояние между точками
    bregma (b) -  lambda (l); измеряется скользящим циркулем.

* Длина большого затылочного отверстия - расстояние между точками
    basion (ba) - opistion (o); измеряется скользящим или штанговым циркулем.

* Ширина большого затылочного отверстия - расстояние между наиболее
    удаленными точками на боковых краях большого затылочного отверстия.
    Измеряетя скользящим или штанговым циркулем.

* Скуловой диаметр - расстояние между точками  zygion (zg)  - zygion (zg);
    измеряется толстотным циркулем.

* Длина основания лица - расстояние между точками  basion (ba) - prostion (pr)
    верхней челюсти.  Измеряется скользящим циркулем.

* Верхняя высота лица - расстояние между точками  nasion (n) - alveolare (al) ;
    измеряется скользящим циркулем.

* Полная высота лица - расстояние между точками  nasion (n) -  gnation (gn).
    NB!!! измеряется скользящим циркулем только при наличии зубов
    на обеих челюстях, обеспечивающих свойственный исследуемому
    черепу прикус!

* Верхняя ширина лица - расстояние между точками   fronto-malare-temporale (fmt) -
    fronto-malare-temporale (fmt); измеряется скользящим циркулем.

* Средняя ширина лица - расстояние между точками  zygomaxillare (zm) -
    zygomaxillare (zm); измеряется скользящим циркулем.

* Высота носа - расстояние между точками  nasion (n) - nasospinale (ns);
    измеряется штанговым или скользящим циркулем.

* Ширина левой орбиты - расстояние между точками maxillofrantale (mf) -
    ektokonchion (ek.). Линия, соединяющая названные точки, делит орбиту
    пополам. Измеряется штанговым или скользящим циркулем.

* Мыщелковая ширина - расстояние между наружными поверхностями
    головок сочленоых отростков нижней челюсти. Измеряется толстотным
    циркулем.

* бигониальная ширина - расстояние между точками  gonion (go) - gonion (go)
    нижней челюсти. Измеряется скользящим циркулем.

* Высота тела (симфиза) нижней челюсти - расстояние между точками
 gnation (gn) -   infradentale (id). Измеряется скользящим циркулем.

 */
    Cranium(){
        super.upBound = 25;
        super.NAME1="череп";
        super.NAME2="черепа";
        super.df = new int[upBound];
        super.method = new String[upBound][2];
    }



    @Override
    /* определение диагностических коэффициентов */
    public String getDF(float  measurement, int step){

        return "ДК = "+method[step][1];
    }

}
